# Numpy

## Part 1)

In [1]:
import numpy as np

In [2]:
# Create array "a"
a = np.array([[1,2,3,3,1], [6,8,11,10,7]]).T
print(a)

[[ 1  6]
 [ 2  8]
 [ 3 11]
 [ 3 10]
 [ 1  7]]

In [3]:
# Find mean of array column-wise
mean_a = np.mean(a, axis=0)
print(mean_a)

[2.  8.4]

## Part 2)

In [4]:
# Demean array "a"
a_centered = (a - mean_a)
print(a_centered)

[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

## Part 3)

In [5]:
# Find scalar product of two columns
a_centered_sp = np.dot(a_centered[:,0],a_centered[:,1])
print(a_centered_sp)

8.0

In [6]:
# Devide scalar product by the (# of observations N - 1): covariance of two columns
N = len(a)
cov = a_centered_sp / (N-1)
print(cov)

2.0

## Part 4)

In [7]:
# Find covariance using built-in method
cov_alt = np.cov(a.T)
print(cov_alt[0,1])

2.0

# Pandas

## Part 1)

Create DFs

In [8]:
import pandas as pd

In [9]:
authors = pd.DataFrame({'author_id':[1, 2, 3], 'author_name':['Тургенев', 'Чехов', 'Островский']})
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [10]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3], 
                     'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 
                     'price':[450, 300, 350, 500, 450, 370, 290]})
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

## Part 2)

Merge DFs

In [11]:
authors_price = pd.merge(left=authors, right=book, how='inner', on='author_id')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

## Part 3)

Find 5 most expensive books

In [12]:
top5 = authors_price.sort_values(by='price', ascending=False).reset_index().loc[:4,['book_title','price']]

## Part 4)

Calculate ststistics for authors

In [13]:
authors_stat = authors_price.groupby('author_name')['price'].agg(['min', 'max', 'mean']).reset_index()
authors_stat.columns = ['author_name', 'min_price', 'max_price', 'mean_price']

round(authors_stat,2)

  author_name  min_price  max_price  mean_price
0  Островский        290        370      330.00
1    Тургенев        300        450      366.67
2       Чехов        450        500      475.00

## Part 5)

Add new column 'cover'

In [14]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

Calculate statistics for summed cover prices for each author and cover type using Pivot Table

In [15]:
book_info = pd.pivot_table(authors_price, values='price', index=['author_name'],
                                                    columns=['cover'], aggfunc=np.sum)
book_info = book_info.fillna(0)
book_info

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0

Save the resulting table as pickle

In [16]:
book_info.to_pickle("book_info.pkl")

In [17]:
book_info2 = pd.read_pickle("book_info.pkl")
book_info2

cover        мягкая  твердая
author_name
Островский    660.0      0.0
Тургенев      650.0    450.0
Чехов           0.0    950.0